# Explain

The **SQL SELF JOIN** is used to join a table to itself as if the table were two tables; temporarily renaming at least one table in the SQL statement.

Syntax
The basic syntax of a **SELF JOIN** is as follows.

```sql
SELECT a.column_name, b.column_name...
FROM table1 a, table1 b
WHERE a.common_field = b.common_field;
```

# Example

## create db

In [1]:
%%bash
../scripts/create_db_server.sh

my-postgresql
4813a96499c66bd533053289df2e62578bc19b295ccb6e44b0cd340f129d90cc

Connection to localhost 5432 port [tcp/postgresql] succeeded!

Created db server

## load sql extension and connect db

In [2]:
%load_ext sql
%sql postgresql://postgres:password123@localhost/dvdrental

## create CUSTOMERS table

In [3]:
%%sql

CREATE TABLE IF NOT EXISTS CUSTOMERS (
   ID   INT              NOT NULL,
   NAME VARCHAR (20)     NOT NULL,
   AGE  INT              NOT NULL,
   ADDRESS  CHAR (25),
   SALARY   DECIMAL (18, 2),
   PRIMARY KEY (ID)
);

INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (1, 'Ha Anh', 32, 'Da Nang', 2000.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (2, 'Van Ha', 25, 'Ha Noi', 1500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (3, 'Vu Bang', 23, 'Vinh', 2000.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (4, 'Thu Minh', 25, 'Ha Noi', 6500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (5, 'Hai An', 27, 'Ha Noi', 8500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (6, 'Hoang', 22, 'Ha Noi', 4500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (7, 'Binh', 24, 'Ha Noi', 10000.00 ) ON CONFLICT DO NOTHING;

SELECT * FROM CUSTOMERS;

 * postgresql://postgres:***@localhost/dvdrental
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
7 rows affected.

[(1, 'Ha Anh', 32, 'Da Nang                  ', Decimal('2000.00')),
 (2, 'Van Ha', 25, 'Ha Noi                   ', Decimal('1500.00')),
 (3, 'Vu Bang', 23, 'Vinh                     ', Decimal('2000.00')),
 (4, 'Thu Minh', 25, 'Ha Noi                   ', Decimal('6500.00')),
 (5, 'Hai An', 27, 'Ha Noi                   ', Decimal('8500.00')),
 (6, 'Hoang', 22, 'Ha Noi                   ', Decimal('4500.00')),
 (7, 'Binh', 24, 'Ha Noi                   ', Decimal('10000.00'))]

## do SELF JOIN

In [4]:
%%sql

SELECT  a.ID, b.NAME, a.SALARY
   FROM CUSTOMERS a, CUSTOMERS b
   WHERE a.SALARY < b.SALARY

 * postgresql://postgres:***@localhost/dvdrental
20 rows affected.

[(1, 'Thu Minh', Decimal('2000.00')),
 (1, 'Hai An', Decimal('2000.00')),
 (1, 'Hoang', Decimal('2000.00')),
 (1, 'Binh', Decimal('2000.00')),
 (2, 'Ha Anh', Decimal('1500.00')),
 (2, 'Vu Bang', Decimal('1500.00')),
 (2, 'Thu Minh', Decimal('1500.00')),
 (2, 'Hai An', Decimal('1500.00')),
 (2, 'Hoang', Decimal('1500.00')),
 (2, 'Binh', Decimal('1500.00')),
 (3, 'Thu Minh', Decimal('2000.00')),
 (3, 'Hai An', Decimal('2000.00')),
 (3, 'Hoang', Decimal('2000.00')),
 (3, 'Binh', Decimal('2000.00')),
 (4, 'Hai An', Decimal('6500.00')),
 (4, 'Binh', Decimal('6500.00')),
 (5, 'Binh', Decimal('8500.00')),
 (6, 'Thu Minh', Decimal('4500.00')),
 (6, 'Hai An', Decimal('4500.00')),
 (6, 'Binh', Decimal('4500.00'))]